Repository: kelvinpaulsirikwa/frontendofapp
Catalog: lib/l10n/intl_*.arb
Languages: sw

# chooseLanguage
source: English
sw: Swahili

source: Agree And Continue
sw: Kubali na Endelea

# welcometoappname
source: Welcome to GestiBora
sw: Karibu kwenye GestiBora

source: Read our
sw: Soma yetu

source: Privacy Policy
sw: Sera ya Faragha

# tapAgree
source: . Tap "Agree and continue" to accept the
sw: . Gonga "Kubali na endelea" kukubaliana na

source: Terms of Service
sw: Masharti ya Huduma

# language
source: English
sw: Kiswahili

source: Guest User
sw: Mtumiaji Mgeni

source: Email not available
sw: Barua pepe haipatikani

source: Log Out
sw: Toka

# logoutConfirmation
source: Are you sure you want to log out?
sw: Una uhakika unataka kutoka?

# cancelAction
source: Cancel
sw: Ghairi

# myActivityTitle
source: My Activity
sw: Shughuli Zangu

# currentStaysTitle
source: Current Stays
sw: Malazi ya Sasa

# currentStaysSubtitle
source: Current stays
sw: Malazi yanayoendelea

# upcomingBookingsTitle
source: Upcoming Bookings
sw: Uhifadhi Ujao

# upcomingBookingsSubtitle
source: Scheduled trips
sw: Safari zilizopangwa

# pastStaysTitle
source: Past Stays
sw: Malazi ya Zamani

# pastStaysSubtitle
source: Previous booked trips
sw: Safari zilizohifadhiwa awali

# paymentHistoryTitle
source: Payment History
sw: Historia ya Malipo

# paymentHistorySubtitle
source: View your payment history
sw: Tazama historia ya malipo yako

# favoritePlacesTitle
source: Favorite Places
sw: Maeneo Unayopenda

# favoritePlacesCount
source: {count, plural, =0 {No properties saved} =1 {1 property saved} other {{count} properties saved}}
sw: {count, plural, =0 {Hakuna nyumba zilizohifadhiwa} =1 {Nyumba 1 imehifadhiwa} other {Nyumba {count} zimehifadhiwa}}

# settingsTitle
source: Settings
sw: Mipangilio

# languageTitle
source: Language
sw: Lugha

# languageSubtitle
source: Change your language
sw: Badilisha lugha yako

# supportAboutTitle
source: Support & About
sw: Msaada na Kuhusu

# aboutBnBTitle
source: About Tanzania BnB
sw: Kuhusu Tanzania BnB

# aboutBnBSubtitle
source: Learn about Tanzania BnB
sw: Jifunze kuhusu Tanzania BnB

# termsOfServiceSubtitle
source: Read our terms of service
sw: Soma masharti ya huduma yetu

# versionLabel
source: Version {version}
sw: Toleo {version}

# missingCustomerIdBookings
source: Unable to load bookings: missing customer id.
sw: Imeshindikana kupakia uhifadhi: kitambulisho cha mteja hakipo.

# missingCustomerIdPastStays
source: Unable to load past stays: missing customer id.
sw: Imeshindikana kupakia malazi ya zamani: kitambulisho cha mteja hakipo.

# missingCustomerIdTransactions
source: Unable to load transactions: missing customer id.
sw: Imeshindikana kupakia miamala: kitambulisho cha mteja hakipo.

source: Failed to load bookings
sw: Imeshindikana kupakia uhifadhi

source: Failed to load past stays
sw: Imeshindikana kupakia malazi ya zamani

source: Failed to load transactions
sw: Imeshindikana kupakia miamala

source: Failed to load more bookings
sw: Imeshindikana kupakia uhifadhi zaidi

source: Failed to load more past stays
sw: Imeshindikana kupakia malazi ya zamani zaidi

source: Failed to load more transactions
sw: Imeshindikana kupakia miamala zaidi

# errorLoadingBookings
source: Error loading bookings: {error}
sw: Hitilafu wakati wa kupakia uhifadhi: {error}

# errorLoadingPastStays
source: Error loading past stays: {error}
sw: Hitilafu wakati wa kupakia malazi ya zamani: {error}

# errorLoadingTransactions
source: Error loading transactions: {error}
sw: Hitilafu wakati wa kupakia miamala: {error}

# errorLoadingMoreBookings
source: Error loading more bookings: {error}
sw: Hitilafu wakati wa kupakia uhifadhi zaidi: {error}

# errorLoadingMorePastStays
source: Error loading more past stays: {error}
sw: Hitilafu wakati wa kupakia malazi ya zamani zaidi: {error}

# errorLoadingMoreTransactions
source: Error loading more transactions: {error}
sw: Hitilafu wakati wa kupakia miamala zaidi: {error}

source: No Bookings Found
sw: Hakuna uhifadhi uliopatikana

# noBookingsResponse
source: No bookings were found in the response
sw: Hakuna uhifadhi uliopatikana kwenye majibu

source: No Transactions Found
sw: Hakuna miamala iliyopatikana

# noTransactionsDescription
source: You don't have any transaction history
sw: Huna historia yoyote ya miamala

source: Message Host
sw: Tuma ujumbe kwa mwenyeji

# nightCount
source: {count, plural, =1 {{count} night} other {{count} nights}}
sw: {count, plural, =1 {Usiku {count}} other {Usiku {count}}}

# pastBookingsAndStaysTitle
source: Past Bookings and Stays
sw: Uhifadhi na Malazi ya Zamani

# stayCompleted
source: Stay completed successfully
sw: Malazi yalikamilika kwa mafanikio

# transactionHistoryTitle
source: Transaction History
sw: Historia ya Miamala

# paymentMethodLabel
source: Payment method: {method}
sw: Njia ya malipo: {method}

# referenceLabel
source: Reference: {reference}
sw: Rejea: {reference}

# amountLabel
source: Amount
sw: Kiasi

# processedLabel
source: Processed
sw: Imechakatwa

# createdLabel
source: Created
sw: Imeundwa

# transactionStatusMessage
source: Transaction {status}
sw: Muamala {status}

# bookingDetailsTitle
source: Booking Details
sw: Maelezo ya Uhifadhi

# bookingReferenceLabel
source: Booking Reference
sw: Rejea ya Uhifadhi

# stayDatesLabel
source: Stay Dates
sw: Tarehe za Kukaa

# nightsLabel
source: Nights
sw: Usiku

# stayTotalLabel
source: Stay Total
sw: Jumla ya Malazi

# propertySectionTitle
source: Property
sw: Mali

# nameLabel
source: Name
sw: Jina

# emailLabel
source: Email
sw: Barua pepe

# addressLabel
source: Address
sw: Anwani

# roomSectionTitle
source: Room
sw: Chumba

# roomLabel
source: Room
sw: Chumba

# pricePerNightLabel
source: Price / Night
sw: Bei kwa Usiku

# guestSectionTitle
source: Guest
sw: Mgeni

# phoneLabel
source: Phone
sw: Simu

# timeAgoDays
source: {count, plural, =1 {{count}d ago} other {{count}d ago}}
sw: {count, plural, =1 {siku {count} zilizopita} other {siku {count} zilizopita}}

# timeAgoHours
source: {count, plural, =1 {{count}h ago} other {{count}h ago}}
sw: {count, plural, =1 {saa {count} zilizopita} other {saa {count} zilizopita}}

# timeAgoMinutes
source: {count, plural, =1 {{count}m ago} other {{count}m ago}}
sw: {count, plural, =1 {dakika {count} zilizopita} other {dakika {count} zilizopita}}

# timeAgoJustNow
source: Just now
sw: Sasa hivi

# homeWelcomeTitle
source: Welcome to Tanzania BnB
sw: Karibu Tanzania BnB

# homeWelcomeSubtitle
source: Discover amazing stays
sw: Gundua malazi ya kuvutia

# homeAccommodationTypeTitle
source: Accommodation Type
sw: Aina ya Malazi

# homeUnknownType
source: Unknown
sw: Haijulikani

# homeNearByTitle
source: Nearby
sw: Karibu

# homeViewAll
source: View all
sw: Tazama yote

# homePopularDestinationsTitle
source: Popular Destinations
sw: Maeneo Maarufu

# homeAllRegions
source: All Regions
sw: Mikoa Yote

# homeAllTypes
source: All Types
sw: Aina Zote

# homeLoadingLabel
source: Loading...
sw: Inapakia...

# homeNoDataTitle
source: No data available. Tap refresh to try again.
sw: Hakuna data. Gusa upya kujaribu tena.

# favoritePageTitle
source: Favorites
sw: Vipendwa

# favoriteEmptyTitle
source: No favorites yet
sw: Bado hakuna vipendwa

# favoriteEmptyDescription
source: Tap the heart icon on a stay to save it for later.
sw: Gonga ikoni ya moyo kwenye malazi uyapendayo ili kuyaokoa kwa baadaye.

# loginSubtitle
source: Your gateway to authentic stays
sw: Mlango wako wa malazi halisi

# loginContinueWithGoogle
source: Continue with Google
sw: Endelea kwa Google

# loginWhyUsTitle
source: Why Us?
sw: Kwa nini sisi?

# loginBenefitSaveFavorites
source: Save your favorite places
sw: Hifadhi maeneo unayoyapenda

# loginBenefitQuickBooking
source: Quick booking process
sw: Mchakato wa kuhifadhi kwa haraka

# loginBenefitExclusiveDeals
source: Get exclusive deals & updates
sw: Pata ofa maalum na masasisho

# loginFooterPrefix
source: By continuing, you agree to our
sw: Kwa kuendelea, unakubali

# loginFooterTerms
source: Terms
sw: Masharti
